Store/src/AccumulationRegisters/ТоварыНаСкладах/ТоварыНаСкладах.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ТоварыНаСкладах</name>
  <resources>
    <name>Количество</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Номенклатура</name>
    <type>
      <types>CatalogRef.Номенклатура</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Склад</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

Store/src/AccumulationRegisters/ТоварыНаСкладах/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает остатки номенклатуры по складам.
//
// Параметры:
//  Номенклатура - СправочникСсылка.Номенклатура - Номенклатура, по которой необходимо получить остатки.
//  Склады - Массив из Строка - Массив складов, по которым необходимо получить остатки.
//
// Возвращаемое значение:
//  Соответствие Из КлючИЗначение - Остатки номенклатуры по складам:
//   * Ключ - Строка - Имя склада.
//   * Значение - Число - Остаток номенклатуры на складе.
//
Функция ОстаткиНоменклатуры(Номенклатура, Склады) Экспорт

	Результат = Новый Соответствие;
	
	Для Каждого Склад из Склады Цикл 
		Запрос = Новый Запрос;
		Запрос.Текст = 
		"ВЫБРАТЬ
		|	ТоварыНаСкладахОстатки.Склад КАК Склад,
		|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК Количество
		|ИЗ
		|	РегистрНакопления.ТоварыНаСкладах.Остатки(, Номенклатура = &Номенклатура И Склад = &Склад) КАК ТоварыНаСкладахОстатки";
	
		Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
		Запрос.УстановитьПараметр("Склад", Склад);
	
		Выборка = Запрос.Выполнить().Выбрать();
		Если Выборка.Следующий() Тогда
			Результат.Вставить(Выборка.Склад, Выборка.Количество);
		КонецЕсли;
	КонецЦикла;

	Возврат Результат;

КонецФункции

// Возвращает остатки товаров на указанном складе.
//
// Параметры:
//  Склад - СправочникСсылка.Склады - Склад, по которому необходимо получить остатки.
//
// Возвращаемое значение:
//  ТаблицаЗначений - Таблица с остатками товаров:
//   * Номенклатура - СправочникСсылка.Номенклатура
//   * КоличествоОстаток - Число - Количество товара на складе
//   * СуммаОстаток - Число - Сумма товара на складе
//
Функция ПолучитьОстаткиТоваровНаСкладе(Склад) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ТоварыНаСкладахОстатки.Номенклатура КАК Номенклатура,
	|	ТоварыНаСкладахОстатки.КоличествоОстаток КАК КоличествоОстаток,
	|	ТоварыНаСкладахОстатки.СуммаОстаток КАК СуммаОстаток
	|ИЗ
	|	РегистрНакопления.ТоварыНаСкладах.Остатки КАК ТоварыНаСкладахОстатки
	|ГДЕ
	|	ТоварыНаСкладахОстатки.Склад = &Склад";
	
	Запрос.УстановитьПараметр("Склад", Склад);
	
	Результат = Запрос.Выполнить();
	
	ТаблицаЗначений = Результат.Выгрузить();
	
	Возврат ТаблицаЗначений;
	
КонецФункции

#КонецОбласти

#КонецЕсли
